#### Terraform Plan (dev) 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_iam_policy.AdministratorAccess: Reading...
aws_vpc.conquer-vpc: Refreshing state... [id=vpc-080a377054fdb71a7]
aws_iam_openid_connect_provider.gh-idp: Refreshing state... [id=arn:aws:iam::014630368052:oidc-provider/token.actions.githubusercontent.com]
aws_ecr_repository.votingapp-ecr-repo: Refreshing state... [id=votingapp]
aws_ecr_repository.conquer-ecr-repo: Refreshing state... [id=dev-conquer-ecr-repo]
aws_iam_role.gh-actions: Refreshing state... [id=gh-actions-role]
aws_internet_gateway.igw: Refreshing state... [id=igw-078f303e3b5f1ddbe]
aws_route53_zone.private-zone: Refreshing state... [id=Z00046993KENG8WFJDVIG]
aws_default_route_table.vpc_default_rt: Refreshing state... [id=rtb-0f0ece682af7b3018]
data.aws_iam_policy.AdministratorAccess: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]
aws_iam_role_policy_attachment.AdministratorAccess: Refreshing state... [id=gh-actions-role-20231015223733555600000001]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_internet_gateway.igw has been deleted
  - resource "aws_internet_gateway" "igw" {
      - id       = "igw-078f303e3b5f1ddbe" -> null
        tags     = {
            "Name" = "dev-conquer-vpc-igw"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_vpc.conquer-vpc has been deleted
  - resource "aws_vpc" "conquer-vpc" {
      - id                                   = "vpc-080a377054fdb71a7" -> null
      - main_route_table_id                  = "rtb-0f0ece682af7b3018" -> null
        tags                                 = {
            "Name" = "dev-conquer-vpc"
        }
        # (14 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_default_route_table.vpc_default_rt will be created
  + resource "aws_default_route_table" "vpc_default_rt" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags                   = {
          + "Name" = "dev-conquer-vpc-default-rt"
        }
      + tags_all               = {
          + "Name"    = "dev-conquer-vpc-default-rt"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_ecr_repository.conquer-ecr-repo will be created
  + resource "aws_ecr_repository" "conquer-ecr-repo" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "dev-conquer-ecr-repo"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.votingapp-ecr-repo will be created
  + resource "aws_ecr_repository" "votingapp-ecr-repo" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "votingapp"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "dev-conquer-vpc-igw"
        }
      + tags_all = {
          + "Name"    = "dev-conquer-vpc-igw"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route53_zone.private-zone will be updated in-place
  ~ resource "aws_route53_zone" "private-zone" {
        id                  = "Z00046993KENG8WFJDVIG"
        name                = "dev-conquer.com"
        tags                = {}
        # (7 unchanged attributes hidden)

      - vpc {
          - vpc_id     = "vpc-080a377054fdb71a7" -> null
          - vpc_region = "eu-north-1" -> null
        }
      + vpc {
          + vpc_id     = (known after apply)
          + vpc_region = (known after apply)
        }
    }

  # aws_vpc.conquer-vpc will be created
  + resource "aws_vpc" "conquer-vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "dev-conquer-vpc"
        }
      + tags_all                             = {
          + "Name"    = "dev-conquer-vpc"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
    }

Plan: 5 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ vpc_id = "vpc-080a377054fdb71a7" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"

```

</details>

*Pusher: @benhur-araujo, Action: `pull_request`, Working Directory: ``, Workflow: `infrastructure`*